**Missing values analysis**

- MVA is very important in Data Analysis
- It is quiet natural data set has missing values
- There are so many techniques :
    - Mean
    - Median
    - Mode
    - bfill
    - ffill
    - pad
    - random values
    - You can compare column values and you can impute
    - KNN imputer

In [3]:
import pandas as pd
import numpy as np

In [37]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
       'Ages':[30,31,np.nan,32],
       'City':[np.nan,'Hyd','Pune','Chennai']}

d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [9]:
d1.isnull()

   Names   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [11]:
d1.isnull().sum()

Names    1
Ages     1
City     1
dtype: int64

In [13]:
dict1={'Names':['Ramesh','Suresh','Sathish','Null'],
       'Ages':[30,31,'Null',32],
       'City':['Null','Hyd','Pune','Chennai']}

d2=pd.DataFrame(dict1)
d2

     Names  Ages     City
0   Ramesh    30     Null
1   Suresh    31      Hyd
2  Sathish  Null     Pune
3     Null    32  Chennai

In [15]:
d2.isnull()

   Names   Ages   City
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [17]:
dict1={'Names':['Ramesh','Suresh','Sathish',None],
       'Ages':[30,31,None,32],
       'City':[None,'Hyd','Pune','Chennai']}

d3=pd.DataFrame(dict1)
d3

     Names  Ages     City
0   Ramesh  30.0     None
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3     None  32.0  Chennai

In [21]:
d3.isnull()

   Names   Ages   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

Values are not present, empty box is there ==== Null value

- np.nan
- None is working
- Sometimes when you read csv if you have missing values it shows as null
- isnull() ---> Best technique

$Method-1$

**Random Fill**

In [33]:
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [35]:
d1.fillna(40,inplace=True)
d1

     Names  Ages     City
0   Ramesh  30.0       40
1   Suresh  31.0      Hyd
2  Sathish  40.0     Pune
3       40  32.0  Chennai

$Method-2$

**Fill the random values based on column**

In [48]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
       'Ages':[30,31,np.nan,32],
       'City':[np.nan,'Hyd','Pune','Chennai']}

d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [46]:
d1['Ages'].fillna(40,inplace=True)
d1

C:\Users\ashux\AppData\Local\Temp\ipykernel_11256\3777523413.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  d1['Ages'].fillna(40,inplace=True)

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  40.0     Pune
3      NaN  32.0  Chennai

In [52]:
d1.fillna({'Ages':50},inplace=True)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  50.0     Pune
3      NaN  32.0  Chennai

$Method-3$

- Mean
- Median
- Mode

In [72]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
       'Ages':[30,31,np.nan,32],
       'City':[np.nan,'Hyd','Pune','Chennai']}

d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

- Median does not affect by outliers
- Mean affect by by outliers
- If you have a data:
    - First check the outlier, by simple boxplot
    - you can check with created outlier function
    - If you feel there is outliers :
        - Then fill missing values with median

In [64]:
age_mean=d1['Ages'].mean()

d1.fillna({'Ages':age_mean},inplace=True)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3      NaN  32.0  Chennai

In [70]:
age_median=d1["Ages"].median()

d1.fillna({'Ages':age_median},inplace=True)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3      NaN  32.0  Chennai

$Method-4$

- pad
- bfill
- ffill
- backfill

In [97]:
dict1={'Names':['Ramesh','Suresh','Sathish',np.nan],
       'Ages':[30,31,np.nan,32],
       'City':[np.nan,'Hyd','Pune','Chennai']}

d1=pd.DataFrame(dict1)
d1

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish   NaN     Pune
3      NaN  32.0  Chennai

In [85]:
d1.fillna(method='pad')  # It fills with previous value of column reference
                         # For the column axis = 0

C:\Users\ashux\AppData\Local\Temp\ipykernel_11256\3282249208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3  Sathish  32.0  Chennai

In [93]:
d1.fillna(method='pad',axis=1)   # for row axis = 1

C:\Users\ashux\AppData\Local\Temp\ipykernel_11256\1966724371.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad',axis=1)

     Names     Ages     City
0   Ramesh     30.0     30.0
1   Suresh     31.0      Hyd
2  Sathish  Sathish     Pune
3      NaN     32.0  Chennai

In [101]:
d1.bfill()

     Names  Ages     City
0   Ramesh  30.0      Hyd
1   Suresh  31.0      Hyd
2  Sathish  32.0     Pune
3      NaN  32.0  Chennai

In [103]:
d1.ffill()

     Names  Ages     City
0   Ramesh  30.0      NaN
1   Suresh  31.0      Hyd
2  Sathish  31.0     Pune
3  Sathish  32.0  Chennai

- pad and ffill both are same
- bfill and backfill both are same

**Categorical columns**

- Categorical column mainly does not have any meaning in dataframes
- If it is some text or sentence you can find the meaning of the sentence
- For example Names column is there, review column is there
- Bacause of only Name itself you can't judge the output
- But a Review can impact the output
- Generally if any naive names kind of columns we can fill in any way
- But if some columns impacting output, Yes we need to fill those columns with an idea about how that column is related with other columns

$Method-5$

**KNN Imputer**

KNN = K-Nearest Neighbours
- It is one of ML model to find the nearest solution based on distance metric
- Instead of taking all the values of mean
- Why can't we take neighbours mean of the observation
- Here first will choose neighbours
- It will then calculate mean of those neighbours and fill with that value

**Package Name**: sklearn.impute
**Method Name**: KNNImputer

In [127]:
from sklearn.impute import KNNImputer
knn=KNNImputer()

d1.values ----> KNNImputer